<template>
    <div class="row col-lg-9 container">
      <card
          v-for="card in cards"
          :card = "card"
      ></card>
    </div>
</template>

<script>
import Card from "@/components/Card";

export default {
  data() {
    return {
      cards: [
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
          {image: require('@/assets/photo.svg'), title: 'Наименование товара', content: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк.', price: 10000},
      ]
    }
  },
  components: {Card},
}
</script>

<style scoped lang="scss">
  .container{
    margin-top: 83px;
  }
</style>